Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Running a vote also entails determining the number and identity of the people eligible to vote, for the purpose of calculating quorum.
pt_pt: Executar uma votação também implica em determinar o número e a identidade das pessoas elegíveis à votação, para o propósito de calcular o quorum.

source: Standing in for other Officers
pt_pt: Ocupar a posição de outros cargos

source: The Project Secretary can stand in for the Leader, together with the Chair of the Technical Committee.
pt_pt: O(A) secretário(a) do projeto pode ocupar a posição do(a) líder, junto com o(a) presidente do comitê técnico.

source: In this situation, they may jointly make decisions if they consider it imperative to do so -- but only when absolutely necessary and only when consistent with the consensus of the Developers.
pt_pt: Nessa situação, eles(as) podem tomar decisões juntos(as) se considerarem imperativo fazê-lo -- mas somente quando for absolutamente necessário e somente quando consistente com o consenso dos(as) desenvolvedores(as).

source: Interpreting the Constitution
pt_pt: Interpretando a constituição

source: The secretary is also responsible for adjudicating any disputes about interpretation of the constitution.
pt_pt: O(A) secretário(a) também é responsável por decidir qualquer disputa sobre a interpretação da constituição.

source: Contact information
pt_pt: Informação de contato

source: Contact the Debian Project Secretary by sending e-mail in English to secretary@debian.org.
pt_pt: Contate o(a) secretário(a) do projeto Debian enviando uma mensagem em inglês para secretary@debian.org.

source: About Our Current Secretary
pt_pt: Sobre nosso(a) secretário(a) atual

source: The current Project Secretary is Kurt Roeckx <kroeckx@debian.org>.
pt_pt: O atual secretário do projeto é Kurt Roeckx <kroeckx@debian.org>.

source: Kurt has been involved with free software and linux since 1995, and has been a Debian Developer since August 2005.
pt_pt: Kurt está envolvido com software livre e linux desde 1995, e tem sido um desenvolvedor Debian desde Agosto de 2005.

source: Kurt has a Masters degree in Electronics and ICT, awarded by Hogeschool voor Wetenschap & Kunst.
pt_pt: Kurt tem mestrado em Eletrônica e TIC, concedido pela Hogeschool voor Wetenschap & Kunst.

source: Kurt has been Project Secretary since February 2009; he took up the position after the previous secretary, Manoj Srivastava, resigned from the position.
pt_pt: Kurt tem sido secretário do projeto desde Fevereiro de 2009; ele assumiu o cargo depois que o secretário anterior, Manoj Srivastava, renunciou ao cargo.

source: Apart from being Project Secretary, Kurt is an AMD64 porter and maintains 12 packages including libtool, ntp and openssl.
pt_pt: Além de ser secretário do projeto, Kurt faz o porte para o AMD64 e mantém 12 pacotes, incluindo libtool, ntp e openssl.

source: The assistant secretary post
pt_pt: O posto de secretário(a) assistente

source: Due to the increasing amount of work (i.e.: votes) that the secretary was starting to need to handle, the DPL (at the time, Steve McIntyre) and the previous secretary (Manoj) decided that it would be a good idea to appoint an assistant in cases of unavailability.
pt_pt: Devido ao aumento da quantidade de trabalho (por exemplo: votação) que o secretário estava começando a manusear, o DPL (na época, Steve McIntyre) e o secretário anterior (Manoj) decidiram que seria uma boa ideia nomear um assistente em casos de indisponibilidade.

source: Currently, Neil McGovern <neilm@debian.org> serves in this position.
pt_pt: Atualmente, Neil McGovern <neilm@debian.org> está nesse cargo.

source: dansk Deutsch español français Italiano Nederlands 日本語 (Nihongo) Português Русский (Russkij) svenska
pt_pt: dansk Deutsch English español français Italiano Nederlands 日本語 (Nihongo) Русский (Russkij) svenska

source: Last Modified: Sat, Aug 20 23:46:48 UTC 2016 Last Built: Tue, Aug 6 19:40:14 UTC 2024
pt_pt: Última Modificação: Qui, 18 de Jun de 2020, 18:23:48 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:35 UTC

source: Debian Developers' Corner / Debian “testing” distribution
pt_pt: Canto dos(as) desenvolvedores(as) Debian / A distribuição Debian teste (“testing”)

source: Debian “testing” distribution
pt_pt: A distribuição Debian teste (“testing”)

source: For basic, user-oriented information about the testing distribution, please see the Debian FAQ.
pt_pt: Para informações básicas aos(às) usuários(as) sobre a distribuição teste (testing), veja a FAQ do Debian.

source: An important thing to note, both for regular users and the developers of testing, is that security updates for testing are not managed by the security team.
pt_pt: Uma coisa importante a ser notada, tanto para usuários(as) regulares quanto para desenvolvedores(as), é que as atualizações de segurança da testing não são gerenciadas pela equipe de segurança.

source: For more information please see the Security Team's FAQ.
pt_pt: Para mais informações veja a FAQ da equipe de segurança.

source: This page primarily covers the aspects of testing important to Debian developers.
pt_pt: Esta página cobre, fundamentalmente, os aspectos da testing que são importantes para desenvolvedores(as) Debian.

source: How testing works
pt_pt: Como a testing funciona

source: The testing distribution is an automatically generated distribution.
pt_pt: A distribuição testing é uma distribuição gerada automaticamente.

source: It is generated from the unstable distribution by a set of scripts which attempt to move over packages which are reasonably likely to lack release-critical bugs.
pt_pt: Ela é gerada a partir da distribuição instável (unstable) por um conjunto de scripts que buscam mover pacotes que provavelmente não possuem bugs críticos ao lançamento (release-critical).

source: They do so in a way that ensures that dependencies of other packages in testing are always satisfiable.
pt_pt: Eles o fazem de modo a garantir que as dependências dos outros pacotes na testing sempre possam ser satisfeitas.

source: A (particular version of a) package will move into testing when it satisfies all of the following criteria:
pt_pt: Um pacote, de uma determinada versão, se moverá para a testing quando ele satisfizer todos os seguintes critérios:

source: It must have been in unstable for 10, 5 or 2 days, depending on the urgency of the upload;
pt_pt: Ele precisa estar na instável (unstable) por 10, 5 ou 2 dias, dependendo da urgência do upload;

source: It must be compiled and up to date on all architectures it has previously been compiled for in unstable;
pt_pt: Ele precisa estar compilado e atualizado em todas as arquiteturas nas quais ele foi anteriormente compilado na instável (unstable);

source: It must not have release-critical bugs which do not also apply to the version currently in testing (see below for more information);
pt_pt: Não pode haver nenhum bug crítico (release-critical), o que também se aplica à versão atualmente na testing (veja abaixo para mais informações);

source: All of its dependencies must either be satisfiable by packages already in testing, or be satisfiable by the group of packages which are going to be installed at the same time;
pt_pt: Todas as suas dependências precisam ser satisfeitas, ou pelos pacotes que já estão na testing, ou pelo grupo de pacotes que serão instalados ao mesmo tempo;

source: The operation of installing the package into testing must not break any packages currently in testing. (See below for more information.)
pt_pt: A operação de instalação do pacote na testing não deve quebrar qualquer outro pacote na testing (Veja abaixo para mais informações.)

source: A package which satisfies the first three of the above is said to be a Valid Candidate.
pt_pt: Um pacote que satisfaz as três primeiras condições acima é considerado um candidato válido (valid candidate).

source: The update script shows when each package might move from unstable into testing.
pt_pt: O script de atualização mostra quando cada pacote deve mover-se da instável (unstable) para a testing.

source: The output is twofold:
pt_pt: A saída é dividida em duas partes:

source: · The update excuses [gzipped]: list of all candidate package versions and the basic status of their propagation into testing; this is somewhat shorter and nicer than
pt_pt: · As justificativas de atualização (update excuses) [compactadas com gzip]: listam todos as versões candidatas dos pacotes e o estado básico de sua propagação para a testing; é um pouco mais curto e mais agradável que

source: · The update output [gzipped]: the complete, rather crude output of the testing scripts as they recurse through the candidates
pt_pt: · A saída de atualização (update output) [compactada com gzip]: a saída completa, pouco refinada, dos scripts da testing conforme eles passam pelos candidatos

source: Frequently Asked/Answered Questions
pt_pt: Dúvidas frequentes

source: What are release-critical bugs, and how do they get counted?
pt_pt: O que são bugs críticos ao lançamento (release-critical), e como eles são contados?

source: All bugs of some higher severities are by default considered release-critical; currently, these are critical, grave and serious bugs.
pt_pt: Todos os bugs de severidades altas são considerados críticos ao lançamento por padrão; atualmente, esses bugs são denominados de críticos (critical), graves (grave) e sérios (serious).

source: Such bugs are presumed to have an impact on the chances that the package will be released with the stable release of Debian: in general, if a package has open release-critical bugs filed on it, it won't get into testing, and consequently won't be released in stable.
pt_pt: Presume-se que tais bugs tenham um impacto nas probabilidades do pacote ser lançado com a versão estável (stable) do Debian: em geral, se um pacote tem bugs críticos ao lançamento, ele não irá para a testing, e consequentemente não será lançado na estável (stable).

source: The testing bug count are all release-critical bugs which are marked to apply to package/version combinations that are available in testingfor a release architecture.
pt_pt: A contagem de bugs na testing é constituída de todos os bugs críticos ao lançamento (release-critical) que, marcados para serem aplicados como combinações pacote/versão, ficam disponíveis na testing para lançamento em uma determinada arquitetura.

source: How could installing a package into testing possibly break other packages?
pt_pt: Como a instalação de um pacote na testing poderia quebrar os outros pacotes?

source: The structure of the distribution archives is such that they can only contain one version of a package; a package is defined by its name.
pt_pt: A estrutura dos repositórios da distribuição é tal que ela pode conter somente uma versão de um pacote; um pacote é definido por seu nome.

source: So, when the source package acmefoo is installed into testing, along with its binary packages acme-foo-bin, acme-bar-bin, libacme-foo1 and libacme-foo-dev, the old version is removed.
pt_pt: Assim, quando o pacote-fonte acmefoo é instalado na testing, junto com seus pacotes binários acme-foo-bin, acme-bar-bin, libacme-foo1 e libacme-foo-dev, a versão antiga é removida.

source: However, the old version may have provided a binary package with an old soname of a library, such as libacme-foo0.
pt_pt: No entanto, a versão mais antiga pode também ter provido um pacote binário com um soname antigo de uma biblioteca, como libacme-foo0.

source: Removing the old acmefoo will remove libacme-foo0, which will break any packages which depend on it.
pt_pt: Remover o acmefoo antigo removerá o libacme-foo0, quebrando qualquer pacote que dependa dele.

source: Evidently, this mainly affects packages which provide changing sets of binary packages in different versions (in turn, mainly libraries).
pt_pt: Evidentemente, isto afeta principalmente pacotes que têm alterações de pacotes binários em versões diferentes (assim sendo, principalmente bibliotecas).

source: However, it will also affect packages upon which versioned dependencies have been declared of the ==, <= or << varieties.
pt_pt: No entanto, pacotes nos quais há dependências de versões declaradas com as comparações ==, <= ou << também serão afetados.

source: When the set of binary packages provided by a source package change in this way, all the packages that depended on the old binaries will have to be updated to depend on the new binaries instead.
pt_pt: Quando os pacotes binários vindos de um pacote-fonte se alteram deste modo, todos os pacotes que dependam das bibliotecas antigas terão que ser atualizados para depender dos binários novos.

source: Because installing such a source package into testing breaks all the packages that depended on it in testing, some care now has to be taken: all the depending packages must be updated and ready to be installed themselves so that they won't be broken, and, once everything is ready, manual intervention by the release manager or an assistant is normally required.
pt_pt: Como a instalação de tais pacotes na testing quebram todos os pacotes que dependem deles na testing, algum cuidado tem que ser tomado: todos os pacotes dependentes precisam estar atualizados e prontos para serem instalados de modo que eles não se quebrarão e, assim que tudo esteja pronto, geralmente é necessária a intervenção manual do gerenciador de lançamento ou um assistente.

source: If you are having problems with complicated groups of packages like this, contact debian-devel or debian-release for help.
pt_pt: Se você está tendo problemas com grupos complicados de pacotes como estes, contate as listas de discussão debian-devel ou a debian-release para receber ajuda.

source: I still don't understand!
pt_pt: Eu ainda não entendo!

source: The testing scripts say that this package is a valid candidate, but it still hasn't gone into testing.
pt_pt: Os scripts da testing dizem que este pacote é um candidato válido, mas ele ainda não foi para a testing.

source: This tends to happen when in some way, directly or indirectly, installing the package will break some other package.
pt_pt: Isto tende a acontecer quando, de algum modo direto ou indireto, instalar o pacote vai quebrar algum outro pacote.

source: Remember to consider your package's dependencies.
pt_pt: Lembre-se de considerar as dependências do seu pacote.

source: Suppose your package depends on libtool, or libltdlX.
pt_pt: Suponha que o seu pacote depende da libtool, ou libltdlX.

source: Your package won't go into testing until the right version of libtool is ready to go in with it.
pt_pt: Seu pacote não irá para a testing até que a versão correta da libtool esteja pronta para ir com ele.

source: In turn, that won't happen until installing libtool doesn't break things already in testing.
pt_pt: Do mesmo modo, isso não irá ocorrer até que a instalação da libtool não quebre pacotes que já estão na testing.

source: In other words, until all other packages which depend on libltdlY (where Y is the earlier version) have been recompiled, and all their release critical bugs are gone, etc, none of these packages will enter testing.
pt_pt: Em outras palavras, até que todos os outros pacotes que dependem da libltdlY (onde Y é a versão anterior) tenham sido recompilados, e todos os seus bugs críticos ao lançamento estiverem corrigidos, etc, nenhum destes pacotes entrará na testing.

source: This is where the textual output [gzipped] is useful: it gives hints (albeit very terse ones) as to which packages break when a valid candidate is added to testing (see the Developer's Reference for more details).
pt_pt: É aqui que a saída de texto [compactada com gzip] é útil: ela dá dicas (embora bastante resumidas) de quais pacotes quebram quando um candidato válido é adicionado à testing (veja a referência para desenvolvedores(as) para mais detalhes).

source: Why is it sometimes hard to get Architecture: all packages into testing?
pt_pt: Por que algumas vezes é difícil ter pacotes Architecture: all na testing?

source: If the Architecture: all package is to be installed, it must be possible to satisfy its dependencies on all architectures.
pt_pt: Se o pacote Architecture: all deve ser instalado, ele precisa satisfazer suas dependências em todas as arquiteturas.

source: If it depends on certain packages which only compile on a limited set of Debian's architectures, then it can't do that.
pt_pt: Se ele depende de determinados pacotes que compilam somente em um conjunto limitado das arquiteturas do Debian, isto não será possível.

source: However, for the time being, testing will ignore Architecture: all packages' installability on non-i386 architectures.
pt_pt: No entanto, e por enquanto, a testing ignorará a capacidade de instalação dos pacotes Architecture: all em arquiteturas não-i386.

source: (It's a gross hack and I'm not really happy to have made it, but there you go. —aj)
pt_pt: (Isto é um hack grosseiro e eu não estou realmente feliz em ter feito isto, mas que seja. —aj)

source: My package is stalled because it's out of date on some architecture.
pt_pt: Meu pacote está parado porque ele está desatualizado em alguma arquitetura.

source: What do I do?
pt_pt: O que eu devo fazer?

source: Check the status of your package in the build log database.
pt_pt: Verifique o estado de seu pacote no banco de dados de logs de construção.

source: If the package doesn't build, it will be marked as failed; investigate the build logs and fix any of the problems that are caused by your package's sources.
pt_pt: Se o pacote não pode ser construído, ele estará marcado como failed (falha); investigue os logs e corrija todos os problemas que foram causados pelas fontes do seu pacote.

source: If you happen to notice that some architectures have built the new version of your package, but it isn't showing up in testing scripts output, then you just have to be a bit more patient until the respective buildd maintainer uploads the files to the Debian archive.
pt_pt: Se você notar que alguma arquitetura construiu a versão nova do seu pacote, mas ele não está aparecendo na saída dos scripts da testing, você só precisa ser um pouco mais paciente até que o(a) mantenedor(a) do respectivo buildd faça o upload dos arquivos para o repositório Debian.

source: If you notice that some architectures haven't built your new version of the package at all, despite the fact you uploaded a fix for an earlier failure, the reason is probably that it's marked as waiting for dependencies (Dep-Wait).
pt_pt: Se você notar que algumas arquiteturas não construíram a nova versão de seu pacote, apesar de você ter feito o upload de uma correção para uma falha anterior, o motivo provavelmente é que ele está marcado como esperando por dependências (Dep-Wait).

source: You can also see the list of these so-called wanna-build states to make sure.
pt_pt: Você também pode ver a lista dos chamados wanna-build states (estados quer construir) para se certificar.

source: These problems usually get fixed eventually, but if you've been waiting for a longer period of time (say, two weeks or more), notify the respective port buildd maintainer if such an address is documented on the port web page, or the mailing list of the port.
pt_pt: Estes problemas acabam sendo corrigidos eventualmente, mas se você está esperando por um período longo de tempo (digamos, duas semanas ou mais), notifique o(a) mantenedor(a) do buildd do respectivo porte se tal contato estiver documentado nas páginas dos portes, ou notifique a lista de discussão do porte.

source: If you have explicitly dropped the architecture from the Architecture list in the control file, and the package has been built for that architecture before, you will need to request that the old binary package for this architecture be removed from the archive before your package can transition to testing.
pt_pt: Se você explicitamente removeu uma arquitetura da lista Architecture no arquivo de controle (control), e o pacote foi construído para aquela arquitetura anteriormente, você precisa requisitar a remoção, no repositório, do antigo pacote binário para esta arquitetura antes que seu pacote possa fazer a transição para a testing.

source: You need to file a bug against ftp.debian.org requesting removal of the dropped architecture's packages from the unstable archive.
pt_pt: Você precisa reportar um bug contra ftp.debian.org requisitando remoção de todos os pacotes das arquiteturas removidas do repositório instável (unstable).

source: Generally the relevant porting list should be informed as a matter of courtesy.
pt_pt: Geralmente, a lista do porte em questão deve ser informada como forma de cortesia.

source: Are there any exceptions?
pt_pt: Existem algumas exceções?

source: I'm sure acmefoo has just made it into testing despite not satisfying all of the requirements.
pt_pt: Eu tenho certeza que o acmefoo entrou na testing apesar de não satisfazer todos os requerimentos.

source: The release manager can override the rules in two ways:
pt_pt: Os(As) gerentes de lançamento podem sobrepujar as regras de dois modos:

source: · They can decide that the breakage caused by the installation of a new library will make things better rather than worse, and let it go in along with its flotilla of dependents.
pt_pt: · Eles(as) podem decidir que a quebra causada pela instalação de uma nova biblioteca irá tornar as coisas melhores em vez de piores, e deixá-la entrar na testing junto com suas dependências.

source: · They can also manually remove packages from testing that would be broken, so that new stuff can be installed.
pt_pt: · Eles(as) também podem remover manualmente pacotes da testing que ficariam quebrados, para que o novo material possa ser instalado.

source: Can you provide a real, non-trivial example?
pt_pt: Você pode dar um exemplo real e não trivial?

source: Here's one: when the source package apache is installed into testing, along with its binary packages apache, apache-common, apache-dev and apache-doc, the old version is removed.
pt_pt: Aqui está um: quando o pacote-fonte apache é instalado na testing, junto com seus pacotes binários apache, apache-common, apache-dev e apache-doc, a versão antiga é removida.

source: However, all Apache module packages depend on apache-common (>= something), apache-common (<< something), so this change breaks all of those dependencies.
pt_pt: No entanto, todos os pacotes de módulos do Apache dependem de apache-common (>=alguma-coisa), apache-common (<< alguma-coisa), assim esta alteração quebra todas essas dependências.

source: Consequently, all Apache modules need to be recompiled against the new version of Apache in order for testing to be updated.
pt_pt: Consequentemente, todos os módulos Apache precisam ser recompilados contra a nova versão do Apache para a testing ser atualizada.

source: Let's elaborate on this a bit further: after all of the modules have been updated in unstable to work with a new Apache, the testing scripts try apache-common and find out that it breaks all the Apache modules because they have Depends: apache-common (<< the current version), and then try libapache-foo to find out that it doesn't install because it has Depends: apache-common (>= the new version).
pt_pt: Vamos elaborar mais um pouco: depois que todos os módulos foram atualizados na instável para trabalhar com o novo Apache, os scripts da testing tentam apache-common e descobrem que ele quebra todos os módulos Apache porque eles tem Depends: apache-common (<< a versão atual); e então tentam libapache-foo para descobrir que ele não instala porque ele tem Depends: apache-common (>= a versão nova).
